package com.bawie.mall;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;

public class MainActivity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        //此处有魔法1，勿动
        //11111111111111111111111111111111111
        //此处有魔法2，勿动

<<<<<< 此处无银三百两
        //发表文章：
//        8条关于动物的流言
//        1、在你睡觉的时候，蜘蛛会爬进你的嘴里。
//        假的。通常有许多种无害的蜘蛛和我们共享一室，
//          而且由于在家里大部分的蜘蛛都体型小又鬼鬼祟祟，因此人们广泛的有着一个错误的观念，
//          他们认为张着嘴睡觉是在邀请夜行蜘蛛来调查自己的扁桃体。Rabaiotti和Caruso写道
//          虽然是有这种可能的，但可能性并不大，因为在夜晚寻找昆虫食物的时候
//          一只小蜘蛛只可能会避开一个大张的人嘴。
//
//        2、在太空中都能看到地球上的企鹅屎。
//        真的。企鹅们拉的屎数量惊人；事实上，生活在南极洲的大群的企鹅所排泄出的屎量惊人，以至于从卫星图上都能看出来。科学家无意中发现了这些粪便“路标”；在2009年对帝企鹅的空中研究期间，研究人员发现了地面上一片片庞大的粪便可以帮助他们准确测定出企鹅栖息地的方位。自从科学家开始从空中观察企鹅屎，他们甚至找出了更多的企鹅栖息地。
//
//        3、鼩鼱会往猪笼草中拉屎。
//        真的。事实上，鼩鼱真的会把猪笼草当做私人厕所。猪笼草是食肉的，它们会用湿滑的深袋诱捕并淹死昆虫甚至是小型哺乳类动物，然后将这些倒霉鬼缓慢的消化掉。但是有三种猪笼草和鼩鼱之间进化出了的共生关系，它们为鼩鼱提供进食(和排泄)的地点，作为交换鼩鼱会为猪笼草提供排泄物中营养丰富的氮。
//
//        4、骆驼可以用驼峰贮藏水分，让它们能在炎热的沙漠中生存下来。
//        假的。没有水，骆驼顶多能活10天，但是它们的秘诀并不在于在驼峰中存水。相反的，它们的驼峰里都是脂肪——成年骆驼的驼峰中有36公斤脂肪——如果食物不足，骆驼会大力利用这些脂肪库存，然后驼峰就会缩小塌陷。骆驼可以长时间不饮水是因为适应性，它们可以非常有效的利用水分，并且避免水分流失。
//
//        5、人的2米范围内总有一只老鼠。
//        假的。这是一条非常有名的流言，暗示着老鼠的数量实在是太庞大了，以至于在你周围的2米内总能发现这些小家伙。但即使老鼠覆盖了地球上每一个人迹罕至的地区，它们的数量也没有大到会有一只躲藏在你身边的几米之外。事实上，纽约市的老鼠数量超过纽约市人口这一条都市流言已经在2014年就被辟谣了，当时一个全面的老鼠目击研究揭示出纽约的老鼠数量大约有200万只。数量是不少，但纽约的人口有800万人。
//
//        6、啄木鸟的舌头会缠绕在它们的头骨上。
//        真的。啄木鸟最著名的莫过于会用鸟喙反复啄击树木的习性，频率大约每秒20次。但是很少有人知道另一个同样极端并且同样不凡的适应性——它们的舌头“老TM长了”，平时会缠在它们的头骨上。在它们整根细长舌头的内部都有骨头，舌头会用来钩出寄生在树中的虫子，或是在它们啄树的时候缠绕在头骨上作为头部的缓震器。
//
//        7、扁形虫用小丁丁决斗。
//        真的。大多数有着小丁丁的动物差不多都会用它们来干同一件事——运送小蝌蚪。扁形虫也不例外，不过会以一场刺刀拼杀作为开始。扁形虫是雌雄同体，也就是说它们既有雄性生殖器官也有雌性的。在交配时，两只扁形虫会用它们的小丁丁格斗，直到一方胜出，然后胜者会将小丁丁攮进败者的OO中，注入自己的小蝌蚪。
//
//        8、巨齿鲨还活着。
//        假的。现代鲨鱼能长到惊人的身长，但是鲨鱼中最大的是在近300万年前灭绝的巨齿鲨，身长可达18米。由于地球的深海广阔并且未被探索，许多人(以及一部近期电影大片)都幻想巨齿鲨仍游弋在海洋中；但缺乏目击和近期的任何迹象都暗示这种怪兽巨鲨早已离我们远去了。
  
    }
}
